Revit 2024 API
BuiltInFailures.DesignOptionFailures.CannotPutELAInOption Property
 Electrical Load Areas must be in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPutELAInOption { get; }
Visual Basic
Public Shared ReadOnly Property CannotPutELAInOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPutELAInOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace